000001 IDENTIFICATION DIVISION.
000002         PROGRAM-ID. Calcula.
000003          AUTHOR ANDERSON.
000004
000005 ENVIRONMENT DIVISION.
000006
000007 DATA DIVISION.
000087 WORKING-STORAGE SECTION.
000067
000008 01 NOME       PIC A(020).
000008 01 N1             PIC 999.
000008 01 N2             PIC 999.
000008 01 RES           PIC 999.
000017
000009 PROCEDURE DIVISION.
000010
000011     DISPLAY "Choose (a/b/c/d): ".
000012     ACCEPT NOME.
000011     DISPLAY "Number 1: ".
000012     ACCEPT N1.
000011     DISPLAY "Number 2: ".
000012     ACCEPT N2.
000012
000012     IF (NOME = "a")
000012         COMPUTE RES=N1+N2
000012     ELSE IF NOME = "b"
000012         COMPUTE RES=N1 - N2
000012     ELSE IF NOME = "c"
000012         COMPUTE RES=N1*N2
000012     ELSE IF NOME = "d"
000012         COMPUTE RES=N1/N2
000012     ELSE
000012         COMPUTE RES=987
000012     END-IF.
000012     
000012     
000064     DISPLAY "Digitado: " NOME "-" N1.
000064     DISPLAY "Resultado: " RES.
000047
000013 END-RUN.
000014 END PROGRAM Calcula.
